tutorials/incompressible/simpleWindFoam/turbineSiting/0/include/sideAndTopPatches
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.com               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

top
{
    type slip;
}

sides
{
    type slip;
}

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
