tutorials/incompressible/simpleWindFoam/turbineSiting/0/nut
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    "terrain_.*"
    {
        type            nutRoughWallFunction;
        Ks              0.2; //Ks = 20 Z0
        Cs              0.5;
        value           uniform 0.0;
    }

    ground
    {
        type            calculated;
        value           uniform 0;
    }

    #include "include/sideAndTopPatches"
}

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
